{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/scripts/markdown/simple_power_example_markdown.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Feb 2019, 01:38:36
{txt}
{com}. //_1
. clear all
{txt}
{com}. //_2
. local max_dataset_number  = 1000
{txt}
{com}. //_3
. local number_post_years = 3
{txt}
{com}. local last_year = 2013-`number_post_years'+1
{txt}
{com}. //_4
. local number_pre_years = 5
{txt}
{com}. local first_year = `last_year'-`number_pre_years'
{txt}
{com}. //_5
. local step_size = .0025 // Quarter of a percent
{txt}
{com}. local end_value = .05 // End at 5%
{txt}
{com}. //_6
. local step_macro 
{txt}
{com}. forvalues x = 0(`step_size')`end_value' {c -(}
{txt}  2{com}.     local step_macro `step_macro'  `x'
{txt}  3{com}. {c )-}
{txt}
{com}. //_7
. local num :  word count `step_macro'
{txt}
{com}. local num = `num'
{txt}
{com}. //_8
. local max_row = `max_dataset_number'*`num'
{txt}
{com}. //_9
. putexcel set "$dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx", replace
{res}{txt}
{com}. //_10
. putexcel A1 = ("dependent_variable")
{res}{txt}file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx saved

{com}. putexcel B1 = ("controls")
{res}{txt}file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx saved

{com}. putexcel C1 = ("weight")
{res}{txt}file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx saved

{com}. putexcel D1 = ("treated_states")
{res}{txt}file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx saved

{com}. putexcel E1 = ("effect_size")
{res}{txt}file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx saved

{com}. //_11
. putexcel F1 = ("deaths_reduced_per_year")
{res}{txt}file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx saved

{com}. putexcel G1 = ("total_deaths_reduced")
{res}{txt}file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx saved

{com}. //_12
. putexcel H1 = ("coef")
{res}{txt}file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx saved

{com}. putexcel I1 = ("se")
{res}{txt}file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx saved

{com}. putexcel J1 = ("df")
{res}{txt}file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx saved

{com}. //_13
. import delimited "$dropbox/health_insurance_and_mortality/state_level_public_data_example/data/Multiple Cause of Death, 1999-2017.txt"
{res}{text}(8 vars, 1,077 obs)

{com}. //_14
. drop if missing(year)
{txt}(108 observations deleted)

{com}. //_15
. drop notes
{txt}
{com}. //_16
. drop if year>=2014
{txt}(204 observations deleted)

{com}. //_17
. drop if year<`first_year'
{txt}(357 observations deleted)

{com}. //_18
. replace state ="AL" if state=="Alabama"
{txt}(8 real changes made)

{com}. replace state ="AK" if state=="Alaska"
{txt}(8 real changes made)

{com}. replace state ="AZ" if state=="Arizona"
{txt}(8 real changes made)

{com}. replace state ="AR" if state=="Arkansas"
{txt}(8 real changes made)

{com}. replace state ="CA" if state=="California"
{txt}(8 real changes made)

{com}. replace state ="CO" if state=="Colorado"
{txt}(8 real changes made)

{com}. replace state ="CT" if state=="ConnecticuÂ "
{txt}(0 real changes made)

{com}. replace state ="DE" if state=="Delaware"
{txt}(8 real changes made)

{com}. replace state ="DC" if state=="District of Columbia"
{txt}(8 real changes made)

{com}. replace state ="FL" if state=="Florida"
{txt}(8 real changes made)

{com}. replace state ="GA" if state=="Georgia"
{txt}(8 real changes made)

{com}. replace state ="HI" if state=="Hawaii"
{txt}(8 real changes made)

{com}. replace state ="ID" if state=="Idaho"
{txt}(8 real changes made)

{com}. replace state ="IL" if state=="Illinois"
{txt}(8 real changes made)

{com}. replace state ="IN" if state=="Indiana"
{txt}(8 real changes made)

{com}. replace state ="IA" if state=="Iowa"
{txt}(8 real changes made)

{com}. replace state ="KS" if state=="Kansas"
{txt}(8 real changes made)

{com}. replace state ="KY" if state=="Kentucky"
{txt}(8 real changes made)

{com}. replace state ="LA" if state=="Louisiana"
{txt}(8 real changes made)

{com}. replace state ="ME" if state=="Maine"
{txt}(8 real changes made)

{com}. replace state ="MD" if state=="Maryland"
{txt}(8 real changes made)

{com}. replace state ="MA" if state=="Massachusetts"
{txt}(8 real changes made)

{com}. replace state ="MI" if state=="Michigan"
{txt}(8 real changes made)

{com}. replace state ="MN" if state=="Minnesota"
{txt}(8 real changes made)

{com}. replace state ="MS" if state=="Mississippi"
{txt}(8 real changes made)

{com}. replace state ="MO" if state=="Missouri"
{txt}(8 real changes made)

{com}. replace state ="MT" if state=="Montana"
{txt}(8 real changes made)

{com}. replace state ="NE" if state=="Nebraska"
{txt}(8 real changes made)

{com}. replace state ="NV" if state=="Nevada"
{txt}(8 real changes made)

{com}. replace state ="NH" if state=="New Hampshire"
{txt}(8 real changes made)

{com}. replace state ="NJ" if state=="New Jersey"
{txt}(8 real changes made)

{com}. replace state ="NM" if state=="New Mexico"
{txt}(8 real changes made)

{com}. replace state ="NY" if state=="New York"
{txt}(8 real changes made)

{com}. replace state ="NC" if state=="North Carolina"
{txt}(8 real changes made)

{com}. replace state ="ND" if state=="North Dakota"
{txt}(8 real changes made)

{com}. replace state ="OH" if state=="Ohio"
{txt}(8 real changes made)

{com}. replace state ="OK" if state=="Oklahoma"
{txt}(8 real changes made)

{com}. replace state ="OR" if state=="Oregon"
{txt}(8 real changes made)

{com}. replace state ="PA" if state=="Pennsylvania"
{txt}(8 real changes made)

{com}. replace state ="RI" if state=="Rhode Island"
{txt}(8 real changes made)

{com}. replace state ="SC" if state=="South Carolina"
{txt}(8 real changes made)

{com}. replace state ="SD" if state=="South Dakota"
{txt}(8 real changes made)

{com}. replace state ="TN" if state=="Tennessee"
{txt}(8 real changes made)

{com}. replace state ="TX" if state=="Texas"
{txt}(8 real changes made)

{com}. replace state ="UT" if state=="Utah"
{txt}(8 real changes made)

{com}. replace state ="VT" if state=="Vermont"
{txt}(8 real changes made)

{com}. replace state ="VA" if state=="Virginia"
{txt}(8 real changes made)

{com}. replace state ="WA" if state=="Washington"
{txt}(8 real changes made)

{com}. replace state ="WV" if state=="West Virginia"
{txt}(8 real changes made)

{com}. replace state ="WI" if state=="Wisconsin"
{txt}(8 real changes made)

{com}. replace state ="WY" if state=="Wyoming"
{txt}(8 real changes made)

{com}. //_19
. gen expansion4=0
{txt}
{com}. label define expansion4 0 "0. Non-expansion" 1 "1. Full expansion" ///
>     2 "2. Mild expansion" 3 "3. Substantial expansion" 
{txt}
{com}. label values expansion4 expansion4
{txt}
{com}. //_20
. local full AZ AR CO IL IA KY MD NV NM NJ ND OH OR RI WV  WA
{txt}
{com}. foreach x in `full' {c -(}
{txt}  2{com}.     replace expansion4=1 if state=="`x'"
{txt}  3{com}. {c )-}     
{txt}(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)

{com}. local mild DE DC MA NY VT
{txt}
{com}. foreach x in `mild' {c -(}
{txt}  2{com}.     replace expansion4=2 if state=="`x'"
{txt}  3{com}. {c )-}
{txt}(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)

{com}. local medium CA CT HI MN WI
{txt}
{com}. foreach x in `medium' {c -(}
{txt}  2{com}.     replace expansion4=3 if state=="`x'"
{txt}  3{com}. {c )-}
{txt}(8 real changes made)
(0 real changes made)
(8 real changes made)
(8 real changes made)
(8 real changes made)

{com}. //_21
. replace expansion4=1 if state=="MI"  //MI expanded in April 2014
{txt}(8 real changes made)

{com}. replace expansion4=1 if state=="NH"  //NH expanded in August 2014
{txt}(8 real changes made)

{com}. replace expansion4=1 if state=="PA"  //PA expanded in Jan 2015
{txt}(8 real changes made)

{com}. replace expansion4=1 if state=="IN"  //IN expanded in Feb 2015
{txt}(8 real changes made)

{com}. replace expansion4=1 if state=="AK"  //AK expanded in Sept 2015
{txt}(8 real changes made)

{com}. replace expansion4=1 if state=="MT"  //MT expanded in Jan 2016
{txt}(8 real changes made)

{com}. replace expansion4=1 if state=="LA"  //LA expanded in July 2016
{txt}(8 real changes made)

{com}. //_22
. drop if expansion4==2 | expansion4==3
{txt}(72 observations deleted)

{com}. //_23
. distinct statecode  if expansion4==1 

{txt}{col 12}{c |}        Observations
{col 12}{c |}      total   distinct
{hline 11}{c +}{hline 22}
 statecode {c |}  {res}      184         23
{txt}
{com}. scalar number_expand = r(ndistinct)    
{txt}
{com}. //_24
. compress
  {txt}variable {bf}expansion4{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}population{sf} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}state{sf} was {bf}{res}str20{sf}{txt} now {bf}{res}str11{sf}
{txt}  (5,376 bytes saved)

{com}. save "$dropbox/health_insurance_and_mortality/state_level_public_data_example/temp/temp_data.dta", replace
{txt}(note: file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/temp/temp_data.dta not found)
file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/temp/temp_data.dta saved

{com}. //_25
. timer on 1
{txt}
{com}. //_26
. local row =2 
{txt}
{com}. //_27
. forvalues dataset_number = 1(1)`max_dataset_number'    {c -(}
{txt}  2{com}.     // Display the dataset number
.     qui di "`dataset_number'"
{txt}  3{com}. //_28
.     // Open main dataset for analysis
.     qui use "$dropbox/health_insurance_and_mortality/state_level_public_data_example/temp/temp_data.dta", clear
{txt}  4{com}. //_29
.     // Set seed for reproducibility. We want the seed to be the same within a dataset. 
.     qui local rand_seed = 1234 + `dataset_number'
{txt}  5{com}.     qui set seed   `rand_seed'
{txt}  6{com}. //_30
.     ///////////////////////////////////////////////////////////////////////////////            
>     // Generate a random variable for each state, then the first N in rank will be 
.     // considered expansion states. Where N is # of expansion states
.     qui bysort statecode: gen random_variable = runiform() if _n==1
{txt}  7{com}.     qui bysort statecode: carryforward random_variable, replace
{txt}  8{com}. //_31
.     // Rank the states
.     qui egen rank = group(random_variable)
{txt}  9{com}. //_32
.     // Given this random ordering of states, assign expansion status to the # set above
.     qui gen expansion = 0 
{txt} 10{com}.     qui replace expansion=1 if rank <=number_expand
{txt} 11{com}. //_33
.     // Do this same thing for the treatment variable
.     qui gen treatment = 0 
{txt} 12{com}.     qui replace treatment = 1 if expansion==1 & year>=`last_year' 
{txt} 13{com}. //_34
.     // Create Post variable
.     qui gen post = 0
{txt} 14{com}.     qui replace post =1 if year>=`last_year' 
{txt} 15{com}. //_35
.     // Store basic data from regression in excel sheet
.     qui putexcel A`row' = ("all_deaths")
{txt} 16{com}.     qui putexcel B`row' = ("no controls")
{txt} 17{com}.     qui putexcel C`row' = ("population")
{txt} 18{com}. //_36
.     // Add list of states to excel sheet
.     qui capture drop test
{txt} 19{com}.     qui gen test = ""
{txt} 20{com}. //_37
.     qui levelsof state if treatment ==1, local(treated_states)
{txt} 21{com}.     foreach x in `treated_states' {c -(}
{txt} 22{com}.         qui replace test = test + ", " + "`x'"
{txt} 23{com}.     {c )-}
{txt} 24{com}. //_38
.     qui local state_list `=test[1]'
{txt} 25{com}.     qui putexcel D`row' = ("`state_list'")
{txt} 26{com}. //_39
.     // Generate a death rate with no effect
.     qui gen death_rate = (deaths/population)*100000
{txt} 27{com}. //_40
.     // Gen order variable 
.     qui gen order = _n
{txt} 28{com}. //_41
.     /////////////////////////////////////////////////////////////////////////////
>     // Create a reduced deaths variable by a given percentage using the binomial for each effect size
.     qui local counter = 1
{txt} 29{com}. //_42
.     foreach x in `step_macro' {c -(}
{txt} 30{com}.         qui gen reduced_deaths_`counter' = 0 
{txt} 31{com}.         qui replace reduced_deaths_`counter' = rbinomial(deaths,`x') if treatment==1
{txt} 32{com}.         qui replace reduced_deaths_`counter'=0 if missing(reduced_deaths_`counter')
{txt} 33{com}. //_43
.         qui gen deaths_`counter' = deaths - reduced_deaths_`counter'
{txt} 34{com}.         qui replace deaths_`counter'=0 if missing(deaths_`counter')
{txt} 35{com}. //_44
.         qui gen death_rate_`counter'= ln((deaths_`counter'/population)*100000+1)
{txt} 36{com}. //_45
.         // Store the effect size in excel sheet
.         qui putexcel E`row' = (`x')
{txt} 37{com}. //_46
.         // Store the number of reduced deaths in excel sheet
.         qui sum reduced_deaths_`counter' if year>=`last_year'
{txt} 38{com}.         qui putexcel F`row' = (`r(sum)'/`number_post_years')
{txt} 39{com}.         qui putexcel G`row' = (`r(sum)')
{txt} 40{com}. //_47
.         // Move the row and counter one forward
.         qui local counter = `counter' + 1 
{txt} 41{com}.         qui local row = `row' + 1
{txt} 42{com}.     {c )-}    
{txt} 43{com}. //_48
.     // Move the row counter back to the top
.     qui local row = `row' - `num' 
{txt} 44{com}. //_49
.     /////////////////////////////////////////////////////////////////////////////
>     // Run regression of treatment on reduced deaths variable for each effect size
. //_50
.     // Reset the counter
.     qui local counter = 1
{txt} 45{com}. //_51
.     forvalues counter = 1(1)`num' {c -(}
{txt} 46{com}. //_52
.         qui reghdfe death_rate_`counter' ///
>             treatment ///
>             i.post i.expansion ///
>             [aweight=population] ///
>             ,  absorb(statecode year)  vce(cluster statecode) 
{txt} 47{com}. //_53
.         // Store results
.         qui putexcel H`row' =(_b[treatment])
{txt} 48{com}.         qui putexcel I`row' = (_se[treatment])
{txt} 49{com}.         qui putexcel J`row' =(`e(df_r)')
{txt} 50{com}. //_54
.         // Display Percent Complete
.         qui di "///////////////////////////////////////////////////////////////////////"
{txt} 51{com}.         qui di "///////////////////////////Percent Complete///////////////////////////"
{txt} 52{com}.         qui di ((`row'-1)/`max_row')*100
{txt} 53{com}.         qui di "///////////////////////////////////////////////////////////////////////"
{txt} 54{com}. //_55
.         qui local row = `row' + 1
{txt} 55{com}.         qui local counter = `counter' + 1
{txt} 56{com}.     {c )-}
{txt} 57{com}. {c )-}
{txt}
{com}. //_56
. timer off 1
{txt}
{com}. timer list
{res}   1:  79905.50 /        1 =   79905.5020
{txt}
{com}. //_57
. erase "$dropbox/health_insurance_and_mortality/state_level_public_data_example/temp/temp_data.dta"
{txt}
{com}. //_58
. import excel "$dropbox/health_insurance_and_mortality/state_level_public_data_example/output/power_simulation_results.xlsx", sheet("Sheet1") firstrow clear    
{res}{txt}
{com}. //_59
. gen z_score = abs(((coef - 0)/se))
{txt}
{com}. gen p_value =  2*ttail(df,z_score)
{txt}
{com}. //_60
. gen power_10 = 0
{txt}
{com}. gen power_05 = 0
{txt}
{com}. gen power_01 = 0
{txt}
{com}. gen power_001 = 0
{txt}
{com}. //_61
. replace power_10 =  1 if p_value<= .1
{txt}(12,536 real changes made)

{com}. replace power_05 =  1 if p_value<= .05
{txt}(11,065 real changes made)

{com}. replace power_01 =  1 if p_value<= .01
{txt}(8,209 real changes made)

{com}. replace power_001 = 1 if p_value<= .001
{txt}(4,872 real changes made)

{com}. //_62
. gen count = 1
{txt}
{com}. //_63
. gen s_error_10 = 0
{txt}
{com}. replace s_error_10 =1 if power_10==1 & coef>=0
{txt}(174 real changes made)

{com}. gen s_error_05 = 0
{txt}
{com}. replace s_error_05 =1 if power_05==1 & coef>=0
{txt}(85 real changes made)

{com}. gen s_error_01 = 0
{txt}
{com}. replace s_error_01 =1 if power_01==1 & coef>=0
{txt}(17 real changes made)

{com}. gen s_error_001 = 0
{txt}
{com}. replace s_error_001 =1 if power_001==1 & coef>=0
{txt}(0 real changes made)

{com}. //_64
. replace s_error_10 =. if effect_size==0
{txt}(1,000 real changes made, 1,000 to missing)

{com}. replace s_error_05 =. if effect_size==0
{txt}(1,000 real changes made, 1,000 to missing)

{com}. replace s_error_01 =. if effect_size==0
{txt}(1,000 real changes made, 1,000 to missing)

{com}. replace s_error_001 =. if effect_size==0
{txt}(1,000 real changes made, 1,000 to missing)

{com}. //_65
. gen m_error = abs(coef/effect_size)
{txt}(1,000 missing values generated)

{com}. gen m_error_10 = m_error
{txt}(1,000 missing values generated)

{com}. replace m_error_10 = . if power_10==0
{txt}(6,628 real changes made, 6,628 to missing)

{com}. gen m_error_05 = m_error
{txt}(1,000 missing values generated)

{com}. replace m_error_05 = . if power_05==0
{txt}(8,030 real changes made, 8,030 to missing)

{com}. gen m_error_01 = m_error
{txt}(1,000 missing values generated)

{com}. replace m_error_01 = . if power_01==0
{txt}(10,820 real changes made, 10,820 to missing)

{com}. gen m_error_001 = m_error
{txt}(1,000 missing values generated)

{com}. replace m_error_001 = . if power_001==0
{txt}(14,130 real changes made, 14,130 to missing)

{com}. //_66
. gen believe_10 = 0 
{txt}
{com}. replace  believe_10 = 1 if power_10 ==1 & s_error_10==0 & m_error_10<=2
{txt}(11,081 real changes made)

{com}. //_67
. gen believe_05 = 0 
{txt}
{com}. replace  believe_05 = 1 if power_05 ==1 & s_error_05==0 & m_error_05<=2
{txt}(9,934 real changes made)

{com}. //_68
. gen believe_01 = 0 
{txt}
{com}. replace  believe_01 = 1 if power_01 ==1 & s_error_01==0 & m_error_01<=2
{txt}(7,502 real changes made)

{com}. //_69
. gen believe_001 = 0 
{txt}
{com}. replace  believe_001 = 1 if power_001 ==1 & s_error_001==0 & m_error_001<=2
{txt}(4,519 real changes made)

{com}. //_70
. collapse (sum) count *power_* *s_error_* *believe_* (mean) *m_error_*, by(effect_size)
{txt}
{com}. //_71
. replace s_error_10 = (s_error_10/power_10)*100
{txt}(5 real changes made)

{com}. replace s_error_05 = (s_error_05/power_05)*100
{txt}(4 real changes made)

{com}. replace s_error_01 = (s_error_01/power_01)*100
{txt}(2 real changes made)

{com}. replace s_error_001 = (s_error_001/power_001)*100
{txt}(0 real changes made)

{com}. //_72
. replace s_error_10 = . if effect_size==0
{txt}(1 real change made, 1 to missing)

{com}. replace s_error_05 = . if effect_size==0
{txt}(1 real change made, 1 to missing)

{com}. replace s_error_01 = . if effect_size==0
{txt}(1 real change made, 1 to missing)

{com}. replace s_error_001 = . if effect_size==0
{txt}(1 real change made, 1 to missing)

{com}. //_73
. ds *power* *believe_*
{txt}{col 1}power_10{col 14}power_01{col 27}believe_10{col 40}believe_01
{col 1}power_05{col 14}power_001{col 27}believe_05{col 40}believe_001

{com}. foreach x in `r(varlist)' {c -(}
{txt}  2{com}.     replace `x' = (`x'/count)*100
{txt}  3{com}. {c )-}
{txt}(20 real changes made)
(20 real changes made)
(20 real changes made)
(20 real changes made)
(16 real changes made)
(15 real changes made)
(14 real changes made)
(13 real changes made)

{com}. //_74
. replace effect_size=effect_size*100
{txt}(19 real changes made)

{com}. //_75
. gen distance_from_80 = (power_05-80)^2
{txt}
{com}. sort distance_from_80
{txt}
{com}. sum effect_size in 1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}effect_size {c |}{res}          1           3           .          3          3
{txt}
{com}. local mde=`r(mean)'
{txt}
{com}. //_76
. capture drop mde_label
{txt}
{com}. gen mde_label = ""
{txt}(20 missing values generated)

{com}. set obs `=_N+1'
{txt}{p}
number of observations (_N)  was 20,
now 21
{p_end}

{com}. replace mde_label = "MDE" in `=_N'
{txt}variable {bf}mde_label{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str3{sf}
{txt}(1 real change made)

{com}. replace effect_size = `mde' in `=_N'
{txt}(1 real change made)

{com}. //_77
. capture drop full_power
{txt}
{com}. gen full_power = 102.5
{txt}
{com}. //_78
. sort effect_size
{txt}
{com}. twoway connected power_10 effect_size ,  lpattern("l") color(sea) msymbol(none) mlabcolor(sea) mlabel("") mlabsize(3) mlabpos(11) ///
>     || connected  power_05 effect_size ,  lpattern(".._") color(turquoise) msymbol(none) mlabcolor(turquoise) mlabel("") mlabsize(3) mlabpos(3) ///
>     || connected  power_01 effect_size , lpattern("_") color(vermillion) msymbol(none) mlabcolor(vermillion) mlabel("") mlabsize(3) mlabpos(3) ///
>     || connected  power_001  effect_size ,  lpattern("l") color(black) msymbol(none) mlabcolor(black) mlabel("") mlabsize(3) mlabpos(3) ///
>     || scatter full_power effect_size , mlabel(mde_label) msymbol(none) mlabpos(12) mlabsize(3.5) ///
>         xline(`mde', lpattern(dash) lcolor(gs3) lwidth(.5) noextend) ///
>         ytitle("Percent with Significant Treatment Effect", size(4)) ///
>         xtitle("Imposed Population Effect (Percent Reduction in Non-Elderly Mortality)", size(4) ) ///
>         xscale(r(0 5)) ///
>         xlabel(, nogrid labsize(4)) ///
>         ylabel(0 "0%" 20 "20%"  40 "40%" 60 "60%" 80 "80%" 100 "100%",gmax noticks labsize(4)) ///
>         legend(order( 1 2 3 4) pos(6) col(4) ///
>             label(1 "{c -(}&alpha{c )-} =.10") label(2 "{c -(}&alpha{c )-} =.05") ///
>             label(3 "{c -(}&alpha{c )-} =.01") label(4 "{c -(}&alpha{c )-} =.001") size(4)) ///
>             title("Simulated Power Analysis; DD, 0-64, All Cause Mortality" " ", size(4)) 
{res}{txt}
{com}. //_79
.     graph export "$dropbox/health_insurance_and_mortality/state_level_public_data_example/scripts/markdown/simulated_power_analysis.png",  replace width(800)
{txt}(file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/scripts/markdown/simulated_power_analysis.png written in PNG format)

{com}. //_80
. sum s_error_10

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}s_error_10 {c |}{res}         19     2.88117    7.122931          0   27.21893
{txt}
{com}. gen  s_error_label= 62.5
{txt}
{com}. twoway connected s_error_10 effect_size ,  lpattern("l") color(sea) msymbol(none) mlabcolor(sea) mlabel("") mlabsize(3) mlabpos(11) ///
>     || connected s_error_05 effect_size  ,  lpattern(".._") color(turquoise) msymbol(none) mlabcolor(turquoise) mlabel("") mlabsize(3) mlabpos(3) ///
>     || connected s_error_01 effect_size  , lpattern("_") color(vermillion) msymbol(none) mlabcolor(vermillion) mlabel("") mlabsize(3) mlabpos(3) ///
>     || connected s_error_001  effect_size  ,  lpattern("l") color(black) msymbol(none) mlabcolor(black) mlabel("") mlabsize(3) mlabpos(3) ///
>     || scatter s_error_label effect_size  , mlabel(mde_label) msymbol(none)  mlabpos(12) mlabsize(4)  ///
>     ytitle("Percent", size(4)) ///
>         xtitle("Imposed Population Effect (Percent Reduction in Non-Elderly Mortality)", size(4)) ///
>         legend(size(4) order(1 2 3 4) pos(6) col(4) label(1 "{c -(}&alpha{c )-} =.10") label(2 "{c -(}&alpha{c )-} =.05") label(3 "{c -(}&alpha{c )-} =.01") label(4 "{c -(}&alpha{c )-} =.001")) ///
>         xscale(r(0 5)) ///
>         xline(`mde', lpattern(dash) lcolor(grey) noextend) ///
>         xlabel( , nogrid labsize(4)) ///
>         ylabel(0 "0%" 20 "20%"  40 "40%" 60 "60%",gmax noticks labsize(4)) ///
>         title("Likelihood of Significant Coefficient Having Wrong Sign" "DD, 0-64, All Cause Mortality" " ", size(4))
{p 0 4 2}
{txt}(note:  named style
grey not found in class
color,  default attributes used)
{p_end}
{res}{txt}
{com}. //_81
.     graph export "$dropbox/health_insurance_and_mortality/state_level_public_data_example/scripts/markdown/s_error.png", replace width(800)
{txt}(file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/scripts/markdown/s_error.png written in PNG format)

{com}. //_82
. sum m_error_001

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}m_error_001 {c |}{res}         19    2.851967    2.875496   1.114921   13.03762
{txt}
{com}. gen  height= `r(max)'*1.05
{txt}
{com}. twoway connected m_error_10 effect_size ,  lpattern("l") color(sea) msymbol(none) mlabcolor(sea) mlabel("") mlabsize(3) mlabpos(11) ///
>     || connected m_error_05 effect_size ,  lpattern(".._") color(turquoise) msymbol(none) mlabcolor(turquoise) mlabel("") mlabsize(3) mlabpos(3) ///
>     || connected m_error_01 effect_size , lpattern("_") color(vermillion) msymbol(none) mlabcolor(vermillion) mlabel("") mlabsize(3) mlabpos(3) ///
>     || connected m_error_001  effect_size ,  lpattern("l") color(black) msymbol(none) mlabcolor(black) mlabel("") mlabsize(3) mlabpos(3) ///
>     || scatter height effect_size , mlabel(mde_label) msymbol(none)  mlabpos(12) mlabsize(4)  ///
>     ytitle("Mean abs(sig coef/imposed effect)", size(4)) ///
>         xtitle("Imposed Population Effect (Percent Reduction in Non-Elderly Mortality)", size(4)) ///
>         legend(size(4) order(1 2 3 4) pos(6) col(4) label(1 "{c -(}&alpha{c )-} =.10") label(2 "{c -(}&alpha{c )-} =.05") label(3 "{c -(}&alpha{c )-} =.01") label(4 "{c -(}&alpha{c )-} =.001")) ///
>         xscale(r(0 5)) ///
>         xline(`mde', lpattern(dash) lcolor(grey) noextend) ///
>         xlabel(, nogrid labsize(4)) ///
>         ylabel(, gmax noticks labsize(4)) ///
>         title("Exaggeration Ratio; DD, 0-64, All Cause Mortality"  " ", size(4))
{p 0 4 2}
{txt}(note:  named style
grey not found in class
color,  default attributes used)
{p_end}
{res}{txt}
{com}. //_83
.         graph export "$dropbox/health_insurance_and_mortality/state_level_public_data_example/scripts/markdown/m_error.png", replace width(800)
{txt}(file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/scripts/markdown/m_error.png written in PNG format)

{com}. //_84
. twoway connected believe_10 effect_size ,  lpattern("l") color(sea) msymbol(none) mlabcolor(sea) mlabel("") mlabsize(3) mlabpos(11) ///
>     || connected believe_05 effect_size ,  lpattern(".._") color(turquoise) msymbol(none) mlabcolor(turquoise) mlabel("") mlabsize(3) mlabpos(3) ///
>     || connected believe_01 effect_size , lpattern("_") color(vermillion) msymbol(none) mlabcolor(vermillion) mlabel("") mlabsize(3) mlabpos(3) ///
>     || connected believe_001  effect_size ,  lpattern("l") color(black) msymbol(none) mlabcolor(black) mlabel("") mlabsize(3) mlabpos(3) ///
>     || scatter full_power effect_size , mlabel(mde_label) msymbol(none) mlabpos(12) mlabsize(4)  ///
>     xtitle("Imposed Population Effect (Percent Reduction in Non-Elderly Mortality)", size(4)) ///
>         legend(size(4) order(1 2 3 4) pos(6) col(4) label(1 "{c -(}&alpha{c )-} =.10") label(2 "{c -(}&alpha{c )-} =.05") label(3 "{c -(}&alpha{c )-} =.01") label(4 "{c -(}&alpha{c )-} =.001")) ///
>                 ytitle("Probability", size(4)) ///
>         xscale(r(0 5)) ///
>         xline(`mde', lpattern(dash) lcolor(grey) noextend) ///
>         xlabel(, nogrid labsize(4)) ///
>         ylabel(0 "0%" 20 "20%"  40 "40%" 60 "60%" 80 "80%" 100 "100%",gmax noticks labsize(4)) ///
>         title("Likelihood of believable coefficient; DD, 0-64, All Cause Mortality" " ", size(4)) 
{p 0 4 2}
{txt}(note:  named style
grey not found in class
color,  default attributes used)
{p_end}
{res}{txt}
{com}. //_85
.     graph export  "$dropbox/health_insurance_and_mortality/state_level_public_data_example/scripts/markdown/believable.png", replace width(800)
{txt}(file /Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/scripts/markdown/believable.png written in PNG format)

{com}. //_86
. display `mde'
{res}3
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/hollinal/Dropbox/health_insurance_and_mortality/state_level_public_data_example/scripts/markdown/simple_power_example_markdown.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Feb 2019, 23:50:38
{txt}{.-}
{smcl}
{txt}{sf}{ul off}